Show / Hide Table of Contents
Class MatReinforcementEc2
Material reinforcement Ec2
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatReinforcement
MatReinforcementEc2
Inherited Members
 MatReinforcement.BarSurface
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.ECEN.MatReinforcementECEN,CI.Material", "CI.StructModel.Libraries.Material.IMatReinforcement,CI.BasicTypes", typeof(MatReinforcement))]
public class MatReinforcementEc2 : MatReinforcement
Examples
This sample shows how to create reinforcement material.
//Creating the model
OpenModel openModel = new OpenModel();
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
matR.Name = "Reinf";
matR.UnitMass = 7850.0;
matR.E = 200e9;
matR.Poisson = 0.2;
matR.G = 83.333e9;
matR.SpecificHeat = 0.6;
matR.ThermalExpansion = 0.00001;
matR.ThermalConductivity = 45;
matR.BarSurface = ReinfBarSurface.Ribbed;
matR.Fyk = 387e6;
matR.CoeffFtkByFyk = 1.05;
matR.Epsuk = 0.025;
matR.Class = ReinfClass.A;
matR.Type = ReinfType.Bars;
matR.Fabrication = ReinfFabrication.HotRolled;
matR.DiagramType = ReinfDiagramType.BilinerWithAnInclinedTopBranch;
//Setting thermal characteristcs of material (in this case by the code)
matR.StateOfThermalConductivity = ThermalConductivityState.Code;
matR.StateOfThermalExpansion = ThermalExpansionState.Code;
matR.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matR.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(matR);
Properties
Improve this Doc   View Source
Class
Class of reinforcement
Declaration
public ReinfClass Class { get; set; }
Property Value
 Type |  Description
 ReinfClass
Improve this Doc   View Source
CoeffFtkByFyk
Coefficient ftk/fyk - k
Declaration
public double CoeffFtkByFyk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagramType
Type of material diagram
Declaration
public ReinfDiagramType DiagramType { get; set; }
Property Value
 Type |  Description
 ReinfDiagramType
Improve this Doc   View Source
Epsuk
Characteristic strain of reinforcement at maximum load - εuk
Declaration
public double Epsuk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fabrication
Fabrication of reinforcement
Declaration
public ReinfFabrication Fabrication { get; set; }
Property Value
 Type |  Description
 ReinfFabrication
Improve this Doc   View Source
Ftk
Characteristic tensile strength of reinforcement - ftk
Declaration
public double Ftk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fyk
Characteristic yield strength of reinforcement - fyk
Declaration
public double Fyk { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Type
Type of reinforcement
Declaration
public ReinfType Type { get; set; }
Property Value
 Type |  Description
 ReinfType
Improve this Doc   View Source
UserDiagram
Stress-strain diagram defined by user
Declaration
public Polygon2D UserDiagram { get; set; }
Property Value
 Type |  Description
 Polygon2D
 Improve this Doc
 View Source